zww546/ESPDMX/stagedmx_std/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16MB flash + custom partition table
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console on USB-Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ===== DMX timing (load-bearing, do not delete) =====
# dmx.c documents the historical failure: the UART TX_DONE interrupt was starved
# by a cache stall -> the driver got stuck in DMX_STATUS_SENDING -> dmx_send()
# returned 0 forever; DMX stopped while BLE kept working, and only a reboot
# recovered it. Keeping the DMX ISR resident in IRAM made that failure disappear.
# NOTE: this line used to live only in the committed sdkconfig (a generated file),
# so editing the defaults had no effect. It is explicit here now, and sdkconfig
# has been removed from version control.
CONFIG_DMX_ISR_IN_IRAM=y

# FATFS long file names (fixture file names such as
# "omarte_ares_p7_34_channels.xml" are far beyond the 8.3 limit)
CONFIG_FATFS_LFN_NONE=n
CONFIG_FATFS_LFN_HEAP=y

# 512-byte logical sectors (matches professional console USB-stick standard)
CONFIG_FATFS_SECTOR_512=y
CONFIG_WL_SECTOR_SIZE_512=y

# FreeRTOS 1000 Hz
CONFIG_FREERTOS_HZ=1000

# BLE NimBLE (peripheral / broadcaster)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
# The host task does large-stack work (file listing / mounting); the default
# 4KB stack overflows, hence 8KB.
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# USB MSC (mass storage) mode via TinyUSB
CONFIG_TINYUSB=y
CONFIG_TINYUSB_MSC_ENABLED=y
# The MSC write buffer must be >= the WL sector size (4096), otherwise
# tinyusb_msc_new_storage_spiflash refuses to create the storage.
CONFIG_TINYUSB_MSC_BUFSIZE=4096
CONFIG_TINYUSB_MSC_MOUNT_PATH="/fw"
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_HID_ENABLED=n
# PSRAM used for the RAM disk
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# Raise the malloc limit to accommodate the RAM disk
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
